Revit 2027 API
CircleLightShape Constructor
Overload List
Name | Description
CircleLightShape() |  Creates a circle light shape object with 2.0' emit diameter.
CircleLightShape(CircleLightShape) |  Creates a copy of the given circle light shape
CircleLightShape(Double) |  Creates a circle light shape object with the given emit diameter.
Top
See Also
Reference
CircleLightShape Class
Autodesk.Revit.DB.Lighting Namespace